#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_availability_zones.available: Reading...
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
data.aws_secretsmanager_secret.github_token: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240819195525719600000001]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_lb_target_group.bff_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-blue-target-group/c2ad97905eee653b]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-06e777883e1f5464b]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/main/ea7fde6e48daa652]
aws_security_group.redis_sg: Refreshing state... [id=sg-0c9a22295813f5385]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/08133f48f3cf881c]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
aws_ecs_task_definition.bff_service_app: Refreshing state... [id=bff-service-app-task]
aws_ecs_service.bff_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_elasticache_replication_group.redis has been deleted
  - resource "aws_elasticache_replication_group" "redis" {
      - configuration_endpoint_address = "my-redis-cluster.k9lirl.clustercfg.euw1.cache.amazonaws.com" -> null
        id                             = "my-redis-cluster"
      - port                           = 6379 -> null
        tags                           = {
            "Name" = "my-redis-cluster"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.bff_service will be updated in-place
  ~ resource "aws_ecs_service" "bff_service" {
        id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service"
        name                               = "bff-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.bff_service_app must be replaced
-/+ resource "aws_ecs_task_definition" "bff_service_app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "CACHE_CONFIG_TTL"
                          - value = "60"
                        },
                      - {
                          - name  = "CLUTCH_BASE_URL"
                          - value = "https://id-sandbox.asics.com"
                        },
                      - {
                          - name  = "CLUTCH_BULKHEAD_MAX_CONCURRENT_CALLS"
                          - value = "100"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                          - value = "50"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_PERMITTED_NUMBER_OF_CALLS_IN_HALF_OPEN_STATE"
                          - value = "5"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_CLOSED_STATE"
                          - value = "100"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_HALF_OPEN_STATE"
                          - value = "10"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_WAIT_DURATION_IN_OPEN_STATE"
                          - value = "30s"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_CAPACITY"
                          - value = "2"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_PERIOD"
                          - value = "60"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_TOKENS"
                          - value = "10"
                        },
                      - {
                          - name  = "CLUTCH_RETRY_MAX_ATTEMPTS"
                          - value = "3"
                        },
                      - {
                          - name  = "CLUTCH_RETRY_WAIT_DURATION"
                          - value = "500ms"
                        },
                      - {
                          - name  = "CLUTCH_TIME_LIMITER_TIMEOUT_DURATION"
                          - value = "2s"
                        },
                      - {
                          - name  = "ENV"
                          - value = "dev"
                        },
                      - {
                          - name  = "GRAPHIQL_ENABLED"
                          - value = "false"
                        },
                      - {
                          - name  = "REDIS_PASSWORD"
                          - value = ""
                        },
                      - {
                          - name  = "REDIS_PORT"
                          - value = "6379"
                        },
                    ]
                  - essential        = true
                  - image            = "802288441694.dkr.ecr.eu-west-1.amazonaws.com/asics-bff:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/bff-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "bff-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8081
                          - hostPort      = 8081
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "bff-service-app-task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_elasticache_replication_group.redis will be created
  + resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = "false"
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Redis replication group with cluster mode enabled"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "tue:06:30-tue:07:30"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t2.micro"
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = 2
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = "default.redis7.cluster.on"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = 1
      + replication_group_description  = (known after apply)
      + replication_group_id           = "my-redis-cluster"
      + security_group_ids             = [
          + "sg-0c9a22295813f5385",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = "01:00-02:00"
      + subnet_group_name              = "redis-subnet-group"
      + tags                           = {
          + "Name" = "my-redis-cluster"
        }
      + tags_all                       = {
          + "Name" = "my-redis-cluster"
        }
      + transit_encryption_enabled     = (known after apply)

      + log_delivery_configuration {
          + destination      = "/cache/redis"
          + destination_type = "cloudwatch-logs"
          + log_format       = "text"
          + log_type         = "slow-log"
        }
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-06e777883e1f5464b"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*